RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjdec_reg.h
/**
  ******************************************************************************
  * @file    mjdec_reg.h
  * @version V1.0
  * @date    2021-07-02
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __MJDEC_REG_H__
#define __MJDEC_REG_H__

#include "bl808.h"

/* 0x0 : jdec_control_1 */
#define MJDEC_JDEC_CONTROL_1_OFFSET     (0x0)
#define MJDEC_REG_MJ_DEC_ENABLE         MJDEC_REG_MJ_DEC_ENABLE
#define MJDEC_REG_MJ_DEC_ENABLE_POS     (0U)
#define MJDEC_REG_MJ_DEC_ENABLE_LEN     (1U)
#define MJDEC_REG_MJ_DEC_ENABLE_MSK     (((1U << MJDEC_REG_MJ_DEC_ENABLE_LEN) - 1) << MJDEC_REG_MJ_DEC_ENABLE_POS)
#define MJDEC_REG_MJ_DEC_ENABLE_UMSK    (~(((1U << MJDEC_REG_MJ_DEC_ENABLE_LEN) - 1) << MJDEC_REG_MJ_DEC_ENABLE_POS))
#define MJDEC_REG_SWAP_MODE             MJDEC_REG_SWAP_MODE
#define MJDEC_REG_SWAP_MODE_POS         (1U)
#define MJDEC_REG_SWAP_MODE_LEN         (1U)
#define MJDEC_REG_SWAP_MODE_MSK         (((1U << MJDEC_REG_SWAP_MODE_LEN) - 1) << MJDEC_REG_SWAP_MODE_POS)
#define MJDEC_REG_SWAP_MODE_UMSK        (~(((1U << MJDEC_REG_SWAP_MODE_LEN) - 1) << MJDEC_REG_SWAP_MODE_POS))
#define MJDEC_REG_U_EVEN                MJDEC_REG_U_EVEN
#define MJDEC_REG_U_EVEN_POS            (2U)
#define MJDEC_REG_U_EVEN_LEN            (1U)
#define MJDEC_REG_U_EVEN_MSK            (((1U << MJDEC_REG_U_EVEN_LEN) - 1) << MJDEC_REG_U_EVEN_POS)
#define MJDEC_REG_U_EVEN_UMSK           (~(((1U << MJDEC_REG_U_EVEN_LEN) - 1) << MJDEC_REG_U_EVEN_POS))
#define MJDEC_REG_YUV_MODE              MJDEC_REG_YUV_MODE
#define MJDEC_REG_YUV_MODE_POS          (3U)
#define MJDEC_REG_YUV_MODE_LEN          (2U)
#define MJDEC_REG_YUV_MODE_MSK          (((1U << MJDEC_REG_YUV_MODE_LEN) - 1) << MJDEC_REG_YUV_MODE_POS)
#define MJDEC_REG_YUV_MODE_UMSK         (~(((1U << MJDEC_REG_YUV_MODE_LEN) - 1) << MJDEC_REG_YUV_MODE_POS))
#define MJDEC_REG_LAST_HF_WBLK_DMY      MJDEC_REG_LAST_HF_WBLK_DMY
#define MJDEC_REG_LAST_HF_WBLK_DMY_POS  (5U)
#define MJDEC_REG_LAST_HF_WBLK_DMY_LEN  (1U)
#define MJDEC_REG_LAST_HF_WBLK_DMY_MSK  (((1U << MJDEC_REG_LAST_HF_WBLK_DMY_LEN) - 1) << MJDEC_REG_LAST_HF_WBLK_DMY_POS)
#define MJDEC_REG_LAST_HF_WBLK_DMY_UMSK (~(((1U << MJDEC_REG_LAST_HF_WBLK_DMY_LEN) - 1) << MJDEC_REG_LAST_HF_WBLK_DMY_POS))
#define MJDEC_REG_LAST_HF_HBLK_DMY      MJDEC_REG_LAST_HF_HBLK_DMY
#define MJDEC_REG_LAST_HF_HBLK_DMY_POS  (6U)
#define MJDEC_REG_LAST_HF_HBLK_DMY_LEN  (1U)
#define MJDEC_REG_LAST_HF_HBLK_DMY_MSK  (((1U << MJDEC_REG_LAST_HF_HBLK_DMY_LEN) - 1) << MJDEC_REG_LAST_HF_HBLK_DMY_POS)
#define MJDEC_REG_LAST_HF_HBLK_DMY_UMSK (~(((1U << MJDEC_REG_LAST_HF_HBLK_DMY_LEN) - 1) << MJDEC_REG_LAST_HF_HBLK_DMY_POS))
#define MJDEC_REG_W_XLEN                MJDEC_REG_W_XLEN
#define MJDEC_REG_W_XLEN_POS            (8U)
#define MJDEC_REG_W_XLEN_LEN            (3U)
#define MJDEC_REG_W_XLEN_MSK            (((1U << MJDEC_REG_W_XLEN_LEN) - 1) << MJDEC_REG_W_XLEN_POS)
#define MJDEC_REG_W_XLEN_UMSK           (~(((1U << MJDEC_REG_W_XLEN_LEN) - 1) << MJDEC_REG_W_XLEN_POS))
#define MJDEC_REG_LAST_HF_BLK_DMY       MJDEC_REG_LAST_HF_BLK_DMY
#define MJDEC_REG_LAST_HF_BLK_DMY_POS   (11U)
#define MJDEC_REG_LAST_HF_BLK_DMY_LEN   (1U)
#define MJDEC_REG_LAST_HF_BLK_DMY_MSK   (((1U << MJDEC_REG_LAST_HF_BLK_DMY_LEN) - 1) << MJDEC_REG_LAST_HF_BLK_DMY_POS)
#define MJDEC_REG_LAST_HF_BLK_DMY_UMSK  (~(((1U << MJDEC_REG_LAST_HF_BLK_DMY_LEN) - 1) << MJDEC_REG_LAST_HF_BLK_DMY_POS))
#define MJDEC_REG_R_XLEN                MJDEC_REG_R_XLEN
#define MJDEC_REG_R_XLEN_POS            (12U)
#define MJDEC_REG_R_XLEN_LEN            (3U)
#define MJDEC_REG_R_XLEN_MSK            (((1U << MJDEC_REG_R_XLEN_LEN) - 1) << MJDEC_REG_R_XLEN_POS)
#define MJDEC_REG_R_XLEN_UMSK           (~(((1U << MJDEC_REG_R_XLEN_LEN) - 1) << MJDEC_REG_R_XLEN_POS))
#define MJDEC_REG_Q_MODE                MJDEC_REG_Q_MODE
#define MJDEC_REG_Q_MODE_POS            (16U)
#define MJDEC_REG_Q_MODE_LEN            (7U)
#define MJDEC_REG_Q_MODE_MSK            (((1U << MJDEC_REG_Q_MODE_LEN) - 1) << MJDEC_REG_Q_MODE_POS)
#define MJDEC_REG_Q_MODE_UMSK           (~(((1U << MJDEC_REG_Q_MODE_LEN) - 1) << MJDEC_REG_Q_MODE_POS))

/* 0x08 : jdec_yy_frame_addr */
#define MJDEC_JDEC_YY_FRAME_ADDR_OFFSET (0x08)
#define MJDEC_REG_YY_ADDR_START         MJDEC_REG_YY_ADDR_START
#define MJDEC_REG_YY_ADDR_START_POS     (0U)
#define MJDEC_REG_YY_ADDR_START_LEN     (32U)
#define MJDEC_REG_YY_ADDR_START_MSK     (((1U << MJDEC_REG_YY_ADDR_START_LEN) - 1) << MJDEC_REG_YY_ADDR_START_POS)
#define MJDEC_REG_YY_ADDR_START_UMSK    (~(((1U << MJDEC_REG_YY_ADDR_START_LEN) - 1) << MJDEC_REG_YY_ADDR_START_POS))

/* 0x0C : jdec_uv_frame_addr */
#define MJDEC_JDEC_UV_FRAME_ADDR_OFFSET (0x0C)
#define MJDEC_REG_UV_ADDR_START         MJDEC_REG_UV_ADDR_START
#define MJDEC_REG_UV_ADDR_START_POS     (0U)
#define MJDEC_REG_UV_ADDR_START_LEN     (32U)
#define MJDEC_REG_UV_ADDR_START_MSK     (((1U << MJDEC_REG_UV_ADDR_START_LEN) - 1) << MJDEC_REG_UV_ADDR_START_POS)
#define MJDEC_REG_UV_ADDR_START_UMSK    (~(((1U << MJDEC_REG_UV_ADDR_START_LEN) - 1) << MJDEC_REG_UV_ADDR_START_POS))

/* 0x1C : jdec_control_3 */
#define MJDEC_JDEC_CONTROL_3_OFFSET       (0x1C)
#define MJDEC_REG_INT_NORMAL_EN           MJDEC_REG_INT_NORMAL_EN
#define MJDEC_REG_INT_NORMAL_EN_POS       (0U)
#define MJDEC_REG_INT_NORMAL_EN_LEN       (1U)
#define MJDEC_REG_INT_NORMAL_EN_MSK       (((1U << MJDEC_REG_INT_NORMAL_EN_LEN) - 1) << MJDEC_REG_INT_NORMAL_EN_POS)
#define MJDEC_REG_INT_NORMAL_EN_UMSK      (~(((1U << MJDEC_REG_INT_NORMAL_EN_LEN) - 1) << MJDEC_REG_INT_NORMAL_EN_POS))
#define MJDEC_REG_INT_IDLE_EN             MJDEC_REG_INT_IDLE_EN
#define MJDEC_REG_INT_IDLE_EN_POS         (1U)
#define MJDEC_REG_INT_IDLE_EN_LEN         (1U)
#define MJDEC_REG_INT_IDLE_EN_MSK         (((1U << MJDEC_REG_INT_IDLE_EN_LEN) - 1) << MJDEC_REG_INT_IDLE_EN_POS)
#define MJDEC_REG_INT_IDLE_EN_UMSK        (~(((1U << MJDEC_REG_INT_IDLE_EN_LEN) - 1) << MJDEC_REG_INT_IDLE_EN_POS))
#define MJDEC_STS_NORMAL_INT              MJDEC_STS_NORMAL_INT
#define MJDEC_STS_NORMAL_INT_POS          (4U)
#define MJDEC_STS_NORMAL_INT_LEN          (1U)
#define MJDEC_STS_NORMAL_INT_MSK          (((1U << MJDEC_STS_NORMAL_INT_LEN) - 1) << MJDEC_STS_NORMAL_INT_POS)
#define MJDEC_STS_NORMAL_INT_UMSK         (~(((1U << MJDEC_STS_NORMAL_INT_LEN) - 1) << MJDEC_STS_NORMAL_INT_POS))
#define MJDEC_STS_IDLE_INT                MJDEC_STS_IDLE_INT
#define MJDEC_STS_IDLE_INT_POS            (5U)
#define MJDEC_STS_IDLE_INT_LEN            (1U)
#define MJDEC_STS_IDLE_INT_MSK            (((1U << MJDEC_STS_IDLE_INT_LEN) - 1) << MJDEC_STS_IDLE_INT_POS)
#define MJDEC_STS_IDLE_INT_UMSK           (~(((1U << MJDEC_STS_IDLE_INT_LEN) - 1) << MJDEC_STS_IDLE_INT_POS))
#define MJDEC_MJPEG_IDLE                  MJDEC_MJPEG_IDLE
#define MJDEC_MJPEG_IDLE_POS              (8U)
#define MJDEC_MJPEG_IDLE_LEN              (1U)
#define MJDEC_MJPEG_IDLE_MSK              (((1U << MJDEC_MJPEG_IDLE_LEN) - 1) << MJDEC_MJPEG_IDLE_POS)
#define MJDEC_MJPEG_IDLE_UMSK             (~(((1U << MJDEC_MJPEG_IDLE_LEN) - 1) << MJDEC_MJPEG_IDLE_POS))
#define MJDEC_MJPEG_FUNC                  MJDEC_MJPEG_FUNC
#define MJDEC_MJPEG_FUNC_POS              (9U)
#define MJDEC_MJPEG_FUNC_LEN              (1U)
#define MJDEC_MJPEG_FUNC_MSK              (((1U << MJDEC_MJPEG_FUNC_LEN) - 1) << MJDEC_MJPEG_FUNC_POS)
#define MJDEC_MJPEG_FUNC_UMSK             (~(((1U << MJDEC_MJPEG_FUNC_LEN) - 1) << MJDEC_MJPEG_FUNC_POS))
#define MJDEC_MJPEG_FLSH                  MJDEC_MJPEG_FLSH
#define MJDEC_MJPEG_FLSH_POS              (11U)
#define MJDEC_MJPEG_FLSH_LEN              (1U)
#define MJDEC_MJPEG_FLSH_MSK              (((1U << MJDEC_MJPEG_FLSH_LEN) - 1) << MJDEC_MJPEG_FLSH_POS)
#define MJDEC_MJPEG_FLSH_UMSK             (~(((1U << MJDEC_MJPEG_FLSH_LEN) - 1) << MJDEC_MJPEG_FLSH_POS))
#define MJDEC_AXI_READ_IDLE               MJDEC_AXI_READ_IDLE
#define MJDEC_AXI_READ_IDLE_POS           (14U)
#define MJDEC_AXI_READ_IDLE_LEN           (1U)
#define MJDEC_AXI_READ_IDLE_MSK           (((1U << MJDEC_AXI_READ_IDLE_LEN) - 1) << MJDEC_AXI_READ_IDLE_POS)
#define MJDEC_AXI_READ_IDLE_UMSK          (~(((1U << MJDEC_AXI_READ_IDLE_LEN) - 1) << MJDEC_AXI_READ_IDLE_POS))
#define MJDEC_AXI_WRITE_IDLE              MJDEC_AXI_WRITE_IDLE
#define MJDEC_AXI_WRITE_IDLE_POS          (15U)
#define MJDEC_AXI_WRITE_IDLE_LEN          (1U)
#define MJDEC_AXI_WRITE_IDLE_MSK          (((1U << MJDEC_AXI_WRITE_IDLE_LEN) - 1) << MJDEC_AXI_WRITE_IDLE_POS)
#define MJDEC_AXI_WRITE_IDLE_UMSK         (~(((1U << MJDEC_AXI_WRITE_IDLE_LEN) - 1) << MJDEC_AXI_WRITE_IDLE_POS))
#define MJDEC_REG_FRAME_CNT_TRGR_INT      MJDEC_REG_FRAME_CNT_TRGR_INT
#define MJDEC_REG_FRAME_CNT_TRGR_INT_POS  (16U)
#define MJDEC_REG_FRAME_CNT_TRGR_INT_LEN  (5U)
#define MJDEC_REG_FRAME_CNT_TRGR_INT_MSK  (((1U << MJDEC_REG_FRAME_CNT_TRGR_INT_LEN) - 1) << MJDEC_REG_FRAME_CNT_TRGR_INT_POS)
#define MJDEC_REG_FRAME_CNT_TRGR_INT_UMSK (~(((1U << MJDEC_REG_FRAME_CNT_TRGR_INT_LEN) - 1) << MJDEC_REG_FRAME_CNT_TRGR_INT_POS))
#define MJDEC_FRAME_VALID_CNT             MJDEC_FRAME_VALID_CNT
#define MJDEC_FRAME_VALID_CNT_POS         (24U)
#define MJDEC_FRAME_VALID_CNT_LEN         (8U)
#define MJDEC_FRAME_VALID_CNT_MSK         (((1U << MJDEC_FRAME_VALID_CNT_LEN) - 1) << MJDEC_FRAME_VALID_CNT_POS)
#define MJDEC_FRAME_VALID_CNT_UMSK        (~(((1U << MJDEC_FRAME_VALID_CNT_LEN) - 1) << MJDEC_FRAME_VALID_CNT_POS))

/* 0x20 : jdec_int_clr */
#define MJDEC_JDEC_INT_CLR_OFFSET    (0x20)
#define MJDEC_REG_INT_CLR            MJDEC_REG_INT_CLR
#define MJDEC_REG_INT_CLR_POS        (0U)
#define MJDEC_REG_INT_CLR_LEN        (1U)
#define MJDEC_REG_INT_CLR_MSK        (((1U << MJDEC_REG_INT_CLR_LEN) - 1) << MJDEC_REG_INT_CLR_POS)
#define MJDEC_REG_INT_CLR_UMSK       (~(((1U << MJDEC_REG_INT_CLR_LEN) - 1) << MJDEC_REG_INT_CLR_POS))
#define MJDEC_REG_YUV_FRAME_POP      MJDEC_REG_YUV_FRAME_POP
#define MJDEC_REG_YUV_FRAME_POP_POS  (1U)
#define MJDEC_REG_YUV_FRAME_POP_LEN  (1U)
#define MJDEC_REG_YUV_FRAME_POP_MSK  (((1U << MJDEC_REG_YUV_FRAME_POP_LEN) - 1) << MJDEC_REG_YUV_FRAME_POP_POS)
#define MJDEC_REG_YUV_FRAME_POP_UMSK (~(((1U << MJDEC_REG_YUV_FRAME_POP_LEN) - 1) << MJDEC_REG_YUV_FRAME_POP_POS))

/* 0x24 : jdec_fram_push */
#define MJDEC_JDEC_FRAM_PUSH_OFFSET (0x24)
#define MJDEC_REG_JP_PUSH           MJDEC_REG_JP_PUSH
#define MJDEC_REG_JP_PUSH_POS       (0U)
#define MJDEC_REG_JP_PUSH_LEN       (1U)
#define MJDEC_REG_JP_PUSH_MSK       (((1U << MJDEC_REG_JP_PUSH_LEN) - 1) << MJDEC_REG_JP_PUSH_POS)
#define MJDEC_REG_JP_PUSH_UMSK      (~(((1U << MJDEC_REG_JP_PUSH_LEN) - 1) << MJDEC_REG_JP_PUSH_POS))
#define MJDEC_REG_JP_ADDR           MJDEC_REG_JP_ADDR
#define MJDEC_REG_JP_ADDR_POS       (2U)
#define MJDEC_REG_JP_ADDR_LEN       (30U)
#define MJDEC_REG_JP_ADDR_MSK       (((1U << MJDEC_REG_JP_ADDR_LEN) - 1) << MJDEC_REG_JP_ADDR_POS)
#define MJDEC_REG_JP_ADDR_UMSK      (~(((1U << MJDEC_REG_JP_ADDR_LEN) - 1) << MJDEC_REG_JP_ADDR_POS))

