RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjdec_reg.h
/* 0x28 : jdec_fram_sts */
#define MJDEC_JDEC_FRAM_STS_OFFSET (0x28)
#define MJDEC_JP_FRAME_CNT         MJDEC_JP_FRAME_CNT
#define MJDEC_JP_FRAME_CNT_POS     (0U)
#define MJDEC_JP_FRAME_CNT_LEN     (5U)
#define MJDEC_JP_FRAME_CNT_MSK     (((1U << MJDEC_JP_FRAME_CNT_LEN) - 1) << MJDEC_JP_FRAME_CNT_POS)
#define MJDEC_JP_FRAME_CNT_UMSK    (~(((1U << MJDEC_JP_FRAME_CNT_LEN) - 1) << MJDEC_JP_FRAME_CNT_POS))

/* 0x2C : jdec_frame_size */
#define MJDEC_JDEC_FRAME_SIZE_OFFSET (0x2C)
#define MJDEC_REG_FRAME_WBLK         MJDEC_REG_FRAME_WBLK
#define MJDEC_REG_FRAME_WBLK_POS     (0U)
#define MJDEC_REG_FRAME_WBLK_LEN     (12U)
#define MJDEC_REG_FRAME_WBLK_MSK     (((1U << MJDEC_REG_FRAME_WBLK_LEN) - 1) << MJDEC_REG_FRAME_WBLK_POS)
#define MJDEC_REG_FRAME_WBLK_UMSK    (~(((1U << MJDEC_REG_FRAME_WBLK_LEN) - 1) << MJDEC_REG_FRAME_WBLK_POS))
#define MJDEC_REG_FRAME_HBLK         MJDEC_REG_FRAME_HBLK
#define MJDEC_REG_FRAME_HBLK_POS     (16U)
#define MJDEC_REG_FRAME_HBLK_LEN     (12U)
#define MJDEC_REG_FRAME_HBLK_MSK     (((1U << MJDEC_REG_FRAME_HBLK_LEN) - 1) << MJDEC_REG_FRAME_HBLK_POS)
#define MJDEC_REG_FRAME_HBLK_UMSK    (~(((1U << MJDEC_REG_FRAME_HBLK_LEN) - 1) << MJDEC_REG_FRAME_HBLK_POS))

/* 0x30 : jdec_header_skip */
#define MJDEC_JDEC_HEADER_SKIP_OFFSET (0x30)
#define MJDEC_REG_HDER_SKIP_BYTE      MJDEC_REG_HDER_SKIP_BYTE
#define MJDEC_REG_HDER_SKIP_BYTE_POS  (0U)
#define MJDEC_REG_HDER_SKIP_BYTE_LEN  (16U)
#define MJDEC_REG_HDER_SKIP_BYTE_MSK  (((1U << MJDEC_REG_HDER_SKIP_BYTE_LEN) - 1) << MJDEC_REG_HDER_SKIP_BYTE_POS)
#define MJDEC_REG_HDER_SKIP_BYTE_UMSK (~(((1U << MJDEC_REG_HDER_SKIP_BYTE_LEN) - 1) << MJDEC_REG_HDER_SKIP_BYTE_POS))
#define MJDEC_REG_HDER_SKIP           MJDEC_REG_HDER_SKIP
#define MJDEC_REG_HDER_SKIP_POS       (16U)
#define MJDEC_REG_HDER_SKIP_LEN       (1U)
#define MJDEC_REG_HDER_SKIP_MSK       (((1U << MJDEC_REG_HDER_SKIP_LEN) - 1) << MJDEC_REG_HDER_SKIP_POS)
#define MJDEC_REG_HDER_SKIP_UMSK      (~(((1U << MJDEC_REG_HDER_SKIP_LEN) - 1) << MJDEC_REG_HDER_SKIP_POS))

/* 0x40 : jp_addr0 */
#define MJDEC_JP_ADDR0_OFFSET (0x40)
#define MJDEC_JP_ADDR_0       MJDEC_JP_ADDR_0
#define MJDEC_JP_ADDR_0_POS   (0U)
#define MJDEC_JP_ADDR_0_LEN   (32U)
#define MJDEC_JP_ADDR_0_MSK   (((1U << MJDEC_JP_ADDR_0_LEN) - 1) << MJDEC_JP_ADDR_0_POS)
#define MJDEC_JP_ADDR_0_UMSK  (~(((1U << MJDEC_JP_ADDR_0_LEN) - 1) << MJDEC_JP_ADDR_0_POS))

/* 0x44 : jp_addr1 */
#define MJDEC_JP_ADDR1_OFFSET (0x44)
#define MJDEC_JP_ADDR_1       MJDEC_JP_ADDR_1
#define MJDEC_JP_ADDR_1_POS   (0U)
#define MJDEC_JP_ADDR_1_LEN   (32U)
#define MJDEC_JP_ADDR_1_MSK   (((1U << MJDEC_JP_ADDR_1_LEN) - 1) << MJDEC_JP_ADDR_1_POS)
#define MJDEC_JP_ADDR_1_UMSK  (~(((1U << MJDEC_JP_ADDR_1_LEN) - 1) << MJDEC_JP_ADDR_1_POS))

/* 0x48 : jp_addr2 */
#define MJDEC_JP_ADDR2_OFFSET (0x48)
#define MJDEC_JP_ADDR_2       MJDEC_JP_ADDR_2
#define MJDEC_JP_ADDR_2_POS   (0U)
#define MJDEC_JP_ADDR_2_LEN   (32U)
#define MJDEC_JP_ADDR_2_MSK   (((1U << MJDEC_JP_ADDR_2_LEN) - 1) << MJDEC_JP_ADDR_2_POS)
#define MJDEC_JP_ADDR_2_UMSK  (~(((1U << MJDEC_JP_ADDR_2_LEN) - 1) << MJDEC_JP_ADDR_2_POS))

/* 0x4C : jp_addr3 */
#define MJDEC_JP_ADDR3_OFFSET (0x4C)
#define MJDEC_JP_ADDR_3       MJDEC_JP_ADDR_3
#define MJDEC_JP_ADDR_3_POS   (0U)
#define MJDEC_JP_ADDR_3_LEN   (32U)
#define MJDEC_JP_ADDR_3_MSK   (((1U << MJDEC_JP_ADDR_3_LEN) - 1) << MJDEC_JP_ADDR_3_POS)
#define MJDEC_JP_ADDR_3_UMSK  (~(((1U << MJDEC_JP_ADDR_3_LEN) - 1) << MJDEC_JP_ADDR_3_POS))

/* 0x50 : jp_addr4 */
#define MJDEC_JP_ADDR4_OFFSET (0x50)
#define MJDEC_JP_ADDR_4       MJDEC_JP_ADDR_4
#define MJDEC_JP_ADDR_4_POS   (0U)
#define MJDEC_JP_ADDR_4_LEN   (32U)
#define MJDEC_JP_ADDR_4_MSK   (((1U << MJDEC_JP_ADDR_4_LEN) - 1) << MJDEC_JP_ADDR_4_POS)
#define MJDEC_JP_ADDR_4_UMSK  (~(((1U << MJDEC_JP_ADDR_4_LEN) - 1) << MJDEC_JP_ADDR_4_POS))

/* 0x54 : jp_addr5 */
#define MJDEC_JP_ADDR5_OFFSET (0x54)
#define MJDEC_JP_ADDR_5       MJDEC_JP_ADDR_5
#define MJDEC_JP_ADDR_5_POS   (0U)
#define MJDEC_JP_ADDR_5_LEN   (32U)
#define MJDEC_JP_ADDR_5_MSK   (((1U << MJDEC_JP_ADDR_5_LEN) - 1) << MJDEC_JP_ADDR_5_POS)
#define MJDEC_JP_ADDR_5_UMSK  (~(((1U << MJDEC_JP_ADDR_5_LEN) - 1) << MJDEC_JP_ADDR_5_POS))

/* 0x58 : jp_addr6 */
#define MJDEC_JP_ADDR6_OFFSET (0x58)
#define MJDEC_JP_ADDR_6       MJDEC_JP_ADDR_6
#define MJDEC_JP_ADDR_6_POS   (0U)
#define MJDEC_JP_ADDR_6_LEN   (32U)
#define MJDEC_JP_ADDR_6_MSK   (((1U << MJDEC_JP_ADDR_6_LEN) - 1) << MJDEC_JP_ADDR_6_POS)
#define MJDEC_JP_ADDR_6_UMSK  (~(((1U << MJDEC_JP_ADDR_6_LEN) - 1) << MJDEC_JP_ADDR_6_POS))

/* 0x5C : jp_addr7 */
#define MJDEC_JP_ADDR7_OFFSET (0x5C)
#define MJDEC_JP_ADDR_7       MJDEC_JP_ADDR_7
#define MJDEC_JP_ADDR_7_POS   (0U)
#define MJDEC_JP_ADDR_7_LEN   (32U)
#define MJDEC_JP_ADDR_7_MSK   (((1U << MJDEC_JP_ADDR_7_LEN) - 1) << MJDEC_JP_ADDR_7_POS)
#define MJDEC_JP_ADDR_7_UMSK  (~(((1U << MJDEC_JP_ADDR_7_LEN) - 1) << MJDEC_JP_ADDR_7_POS))

/* 0x60 : jp_addr_8 */
#define MJDEC_JP_ADDR_8_OFFSET (0x60)
#define MJDEC_JP_ADDR_8        MJDEC_JP_ADDR_8
#define MJDEC_JP_ADDR_8_POS    (0U)
#define MJDEC_JP_ADDR_8_LEN    (32U)
#define MJDEC_JP_ADDR_8_MSK    (((1U << MJDEC_JP_ADDR_8_LEN) - 1) << MJDEC_JP_ADDR_8_POS)
#define MJDEC_JP_ADDR_8_UMSK   (~(((1U << MJDEC_JP_ADDR_8_LEN) - 1) << MJDEC_JP_ADDR_8_POS))

/* 0x64 : jp_addr_9 */
#define MJDEC_JP_ADDR_9_OFFSET (0x64)
#define MJDEC_JP_ADDR_9        MJDEC_JP_ADDR_9
#define MJDEC_JP_ADDR_9_POS    (0U)
#define MJDEC_JP_ADDR_9_LEN    (32U)
#define MJDEC_JP_ADDR_9_MSK    (((1U << MJDEC_JP_ADDR_9_LEN) - 1) << MJDEC_JP_ADDR_9_POS)
#define MJDEC_JP_ADDR_9_UMSK   (~(((1U << MJDEC_JP_ADDR_9_LEN) - 1) << MJDEC_JP_ADDR_9_POS))

/* 0x68 : jp_addr_a */
#define MJDEC_JP_ADDR_A_OFFSET (0x68)
#define MJDEC_JP_ADDR_A        MJDEC_JP_ADDR_A
#define MJDEC_JP_ADDR_A_POS    (0U)
#define MJDEC_JP_ADDR_A_LEN    (32U)
#define MJDEC_JP_ADDR_A_MSK    (((1U << MJDEC_JP_ADDR_A_LEN) - 1) << MJDEC_JP_ADDR_A_POS)
#define MJDEC_JP_ADDR_A_UMSK   (~(((1U << MJDEC_JP_ADDR_A_LEN) - 1) << MJDEC_JP_ADDR_A_POS))

/* 0x6C : jp_addr_b */
#define MJDEC_JP_ADDR_B_OFFSET (0x6C)
#define MJDEC_JP_ADDR_B        MJDEC_JP_ADDR_B
#define MJDEC_JP_ADDR_B_POS    (0U)
#define MJDEC_JP_ADDR_B_LEN    (32U)
#define MJDEC_JP_ADDR_B_MSK    (((1U << MJDEC_JP_ADDR_B_LEN) - 1) << MJDEC_JP_ADDR_B_POS)
#define MJDEC_JP_ADDR_B_UMSK   (~(((1U << MJDEC_JP_ADDR_B_LEN) - 1) << MJDEC_JP_ADDR_B_POS))

/* 0x70 : jp_addr_c */
#define MJDEC_JP_ADDR_C_OFFSET (0x70)
#define MJDEC_JP_ADDR_C        MJDEC_JP_ADDR_C
#define MJDEC_JP_ADDR_C_POS    (0U)
#define MJDEC_JP_ADDR_C_LEN    (32U)
#define MJDEC_JP_ADDR_C_MSK    (((1U << MJDEC_JP_ADDR_C_LEN) - 1) << MJDEC_JP_ADDR_C_POS)
#define MJDEC_JP_ADDR_C_UMSK   (~(((1U << MJDEC_JP_ADDR_C_LEN) - 1) << MJDEC_JP_ADDR_C_POS))

/* 0x74 : jp_addr_d */
#define MJDEC_JP_ADDR_D_OFFSET (0x74)
#define MJDEC_JP_ADDR_D        MJDEC_JP_ADDR_D
#define MJDEC_JP_ADDR_D_POS    (0U)
#define MJDEC_JP_ADDR_D_LEN    (32U)
#define MJDEC_JP_ADDR_D_MSK    (((1U << MJDEC_JP_ADDR_D_LEN) - 1) << MJDEC_JP_ADDR_D_POS)
#define MJDEC_JP_ADDR_D_UMSK   (~(((1U << MJDEC_JP_ADDR_D_LEN) - 1) << MJDEC_JP_ADDR_D_POS))

/* 0x78 : jp_addr_e */
#define MJDEC_JP_ADDR_E_OFFSET (0x78)
#define MJDEC_JP_ADDR_E        MJDEC_JP_ADDR_E
#define MJDEC_JP_ADDR_E_POS    (0U)
#define MJDEC_JP_ADDR_E_LEN    (32U)
#define MJDEC_JP_ADDR_E_MSK    (((1U << MJDEC_JP_ADDR_E_LEN) - 1) << MJDEC_JP_ADDR_E_POS)
#define MJDEC_JP_ADDR_E_UMSK   (~(((1U << MJDEC_JP_ADDR_E_LEN) - 1) << MJDEC_JP_ADDR_E_POS))

