RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjdec_reg.h
/* 0x7C : jp_addr_f */
#define MJDEC_JP_ADDR_F_OFFSET (0x7C)
#define MJDEC_JP_ADDR_F        MJDEC_JP_ADDR_F
#define MJDEC_JP_ADDR_F_POS    (0U)
#define MJDEC_JP_ADDR_F_LEN    (32U)
#define MJDEC_JP_ADDR_F_MSK    (((1U << MJDEC_JP_ADDR_F_LEN) - 1) << MJDEC_JP_ADDR_F_POS)
#define MJDEC_JP_ADDR_F_UMSK   (~(((1U << MJDEC_JP_ADDR_F_LEN) - 1) << MJDEC_JP_ADDR_F_POS))

/* 0x1F0 : mjdec_debug */
#define MJDEC_DEBUG_OFFSET           (0x1F0)
#define MJDEC_REG_MJDEC_DBG_EN       MJDEC_REG_MJDEC_DBG_EN
#define MJDEC_REG_MJDEC_DBG_EN_POS   (0U)
#define MJDEC_REG_MJDEC_DBG_EN_LEN   (1U)
#define MJDEC_REG_MJDEC_DBG_EN_MSK   (((1U << MJDEC_REG_MJDEC_DBG_EN_LEN) - 1) << MJDEC_REG_MJDEC_DBG_EN_POS)
#define MJDEC_REG_MJDEC_DBG_EN_UMSK  (~(((1U << MJDEC_REG_MJDEC_DBG_EN_LEN) - 1) << MJDEC_REG_MJDEC_DBG_EN_POS))
#define MJDEC_REG_MJDEC_DBG_SEL      MJDEC_REG_MJDEC_DBG_SEL
#define MJDEC_REG_MJDEC_DBG_SEL_POS  (4U)
#define MJDEC_REG_MJDEC_DBG_SEL_LEN  (4U)
#define MJDEC_REG_MJDEC_DBG_SEL_MSK  (((1U << MJDEC_REG_MJDEC_DBG_SEL_LEN) - 1) << MJDEC_REG_MJDEC_DBG_SEL_POS)
#define MJDEC_REG_MJDEC_DBG_SEL_UMSK (~(((1U << MJDEC_REG_MJDEC_DBG_SEL_LEN) - 1) << MJDEC_REG_MJDEC_DBG_SEL_POS))

/* 0x1FC : mjdec_dummy_reg */
#define MJDEC_DUMMY_REG_OFFSET    (0x1FC)
#define MJDEC_JDEC_DUMMY_REG      MJDEC_JDEC_DUMMY_REG
#define MJDEC_JDEC_DUMMY_REG_POS  (0U)
#define MJDEC_JDEC_DUMMY_REG_LEN  (32U)
#define MJDEC_JDEC_DUMMY_REG_MSK  (((1U << MJDEC_JDEC_DUMMY_REG_LEN) - 1) << MJDEC_JDEC_DUMMY_REG_POS)
#define MJDEC_JDEC_DUMMY_REG_UMSK (~(((1U << MJDEC_JDEC_DUMMY_REG_LEN) - 1) << MJDEC_JDEC_DUMMY_REG_POS))

struct mjdec_reg {
    /* 0x0 : jdec_control_1 */
    union {
        struct {
            uint32_t reg_mj_dec_enable    : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_swap_mode        : 1; /* [    1],        r/w,        0x0 */
            uint32_t reg_u_even           : 1; /* [    2],        r/w,        0x1 */
            uint32_t reg_yuv_mode         : 2; /* [ 4: 3],        r/w,        0x0 */
            uint32_t reg_last_hf_wblk_dmy : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_last_hf_hblk_dmy : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7           : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_w_xlen           : 3; /* [10: 8],        r/w,        0x3 */
            uint32_t reg_last_hf_blk_dmy  : 1; /* [   11],        r/w,        0x0 */
            uint32_t reg_r_xlen           : 3; /* [14:12],        r/w,        0x3 */
            uint32_t reserved_15          : 1; /* [   15],       rsvd,        0x0 */
            uint32_t reg_q_mode           : 7; /* [22:16],        r/w,       0x32 */
            uint32_t reserved_23_31       : 9; /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } jdec_control_1;

    /* 0x4  reserved */
    uint8_t RESERVED0x4[4];

    /* 0x08 : jdec_yy_frame_addr */
    union {
        struct {
            uint32_t reg_yy_addr_start : 32; /* [31: 0],        r/w, 0x80000000 */
        } BF;
        uint32_t WORD;
    } jdec_yy_frame_addr;

    /* 0x0C : jdec_uv_frame_addr */
    union {
        struct {
            uint32_t reg_uv_addr_start : 32; /* [31: 0],        r/w, 0x80000000 */
        } BF;
        uint32_t WORD;
    } jdec_uv_frame_addr;

    /* 0x10  reserved */
    uint8_t RESERVED0x10[12];

    /* 0x1C : jdec_control_3 */
    union {
        struct {
            uint32_t reg_int_normal_en      : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_int_idle_en        : 1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_3           : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t sts_normal_int         : 1; /* [    4],          r,        0x0 */
            uint32_t sts_idle_int           : 1; /* [    5],          r,        0x0 */
            uint32_t reserved_6_7           : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t mjpeg_idle             : 1; /* [    8],          r,        0x1 */
            uint32_t mjpeg_func             : 1; /* [    9],          r,        0x0 */
            uint32_t reserved_10            : 1; /* [   10],       rsvd,        0x0 */
            uint32_t mjpeg_flsh             : 1; /* [   11],          r,        0x0 */
            uint32_t reserved_12_13         : 2; /* [13:12],       rsvd,        0x0 */
            uint32_t axi_read_idle          : 1; /* [   14],          r,        0x0 */
            uint32_t axi_write_idle         : 1; /* [   15],          r,        0x0 */
            uint32_t reg_frame_cnt_trgr_int : 5; /* [20:16],        r/w,        0x0 */
            uint32_t reserved_21_23         : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t frame_valid_cnt        : 8; /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jdec_control_3;

    /* 0x20 : jdec_int_clr */
    union {
        struct {
            uint32_t reg_int_clr       : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reg_yuv_frame_pop : 1;  /* [    1],        w1p,        0x0 */
            uint32_t reserved_2_31     : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } jdec_int_clr;

    /* 0x24 : jdec_fram_push */
    union {
        struct {
            uint32_t reg_jp_push : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reserved_1  : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t reg_jp_addr : 30; /* [31: 2],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } jdec_fram_push;

    /* 0x28 : jdec_fram_sts */
    union {
        struct {
            uint32_t jp_frame_cnt  : 5;  /* [ 4: 0],          r,        0x0 */
            uint32_t reserved_5_31 : 27; /* [31: 5],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } jdec_fram_sts;

    /* 0x2C : jdec_frame_size */
    union {
        struct {
            uint32_t reg_frame_wblk : 12; /* [11: 0],        r/w,        0xf */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_frame_hblk : 12; /* [27:16],        r/w,       0x14 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } jdec_frame_size;

    /* 0x30 : jdec_header_skip */
    union {
        struct {
            uint32_t reg_hder_skip_byte : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_hder_skip      : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31     : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } jdec_header_skip;

    /* 0x34  reserved */
    uint8_t RESERVED0x34[12];

    /* 0x40 : jp_addr0 */
    union {
        struct {
            uint32_t jp_addr_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr0;

