RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjdec_reg.h
    /* 0x44 : jp_addr1 */
    union {
        struct {
            uint32_t jp_addr_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr1;

    /* 0x48 : jp_addr2 */
    union {
        struct {
            uint32_t jp_addr_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr2;

    /* 0x4C : jp_addr3 */
    union {
        struct {
            uint32_t jp_addr_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr3;

    /* 0x50 : jp_addr4 */
    union {
        struct {
            uint32_t jp_addr_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr4;

    /* 0x54 : jp_addr5 */
    union {
        struct {
            uint32_t jp_addr_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr5;

    /* 0x58 : jp_addr6 */
    union {
        struct {
            uint32_t jp_addr_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr6;

    /* 0x5C : jp_addr7 */
    union {
        struct {
            uint32_t jp_addr_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr7;

    /* 0x60 : jp_addr_8 */
    union {
        struct {
            uint32_t jp_addr_8 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr_8;

    /* 0x64 : jp_addr_9 */
    union {
        struct {
            uint32_t jp_addr_9 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr_9;

    /* 0x68 : jp_addr_a */
    union {
        struct {
            uint32_t jp_addr_a : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr_a;

    /* 0x6C : jp_addr_b */
    union {
        struct {
            uint32_t jp_addr_b : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr_b;

    /* 0x70 : jp_addr_c */
    union {
        struct {
            uint32_t jp_addr_c : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr_c;

    /* 0x74 : jp_addr_d */
    union {
        struct {
            uint32_t jp_addr_d : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr_d;

    /* 0x78 : jp_addr_e */
    union {
        struct {
            uint32_t jp_addr_e : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr_e;

    /* 0x7C : jp_addr_f */
    union {
        struct {
            uint32_t jp_addr_f : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } jp_addr_f;

    /* 0x80  reserved */
    uint8_t RESERVED0x80[368];

    /* 0x1F0 : mjdec_debug */
    union {
        struct {
            uint32_t reg_mjdec_dbg_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3      : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_mjdec_dbg_sel : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjdec_debug;

    /* 0x1f4  reserved */
    uint8_t RESERVED0x1f4[8];

    /* 0x1FC : mjdec_dummy_reg */
    union {
        struct {
            uint32_t jdec_dummy_reg : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } mjdec_dummy_reg;
};

typedef volatile struct mjdec_reg mjdec_reg_t;

#endif /* __MJDEC_REG_H__ */
